Revit 2024 API
AppearanceAssetEditScope Properties
The AppearanceAssetEditScope type exposes the following members.
Properties
Name | Description
IsActive
 Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace